examples/permeable_flat_plate/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

//internalField   uniform (1.562e-3 0 0.0);
internalField   uniform (8.778 0 0.0);

boundaryField
{
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
    top
    {
        type            fixedValue;
		value           uniform (0 0 0);
    }
    bottom
    {
        type            zeroGradient;
    }
   inlet_porous
    {
        type            cyclic;
    }

	outlet_porous
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
