examples/permeable_flat_plate/0.orig/anisotropyK
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      anisotropyK;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (1 0 0 0 1 0 0 0 1);

boundaryField
{
    top
    {
        type            calculated;
        value           uniform (1 0 0 0 1 0 0 0 1);
    }
    bottom
    {
        type            calculated;
        value           uniform (1 0 0 0 1 0 0 0 1);
    }
    inlet_porous
    {
        type            cyclic;
    }
	
	outlet_porous
    {
        type            cyclic;
    }
	
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
