examples/permeable_flat_plate/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Re = 5500 ; I = 0.16 * Re**(-1/8) = 
// k = (3/2)*(U_ref*I)**2 = 

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.343583;

boundaryField
{
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
    top
    {
        type            fixedValue;
		value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
   inlet_porous
    {
        type            cyclic;
    }
	
	outlet_porous
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
