examples/permeable_flat_plate/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
    top
    {
        type            nutkWallFunction;
		value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
   inlet_porous
    {
        type            cyclic;
    }
	
	outlet_porous
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}



// ************************************************************************* //
