examples/permeable_flat_plate/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            patchMeanVelocityForce;
	active			yes;
	
	patchMeanVelocityForceCoeffs
	{

    selectionMode   all;
    fields          (U);
    Ubar            (8.778 0 0);
	patch			inlet;
	relaxation		0.2;
	}
}


// ************************************************************************* //
