examples/permeable_flat_plate/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       off;

heterogeneousRadiationModel  none;

// Number of flow iterations per radiation iteration
solverFreq 1;

heterogeneousAbsorptionEmissionModel heterogeneousConstantAbsorptionEmission;

// These values are chosen to support
// heating rate comparable with experimental borderL*borderAs
// mesh independence borderL

heterogeneousConstantAbsorptionEmissionCoeffs
{
    a               a  [ 0 -1  0 0 0 0 0 ] 0;   //era 20
    as              as [ 0 -1  0 0 0 0 0 ] 0;
    borderAs        borderAs [ 0 -1  0 0 0 0 0 ] 180;
    E               E  [ 1 -1 -3 0 0 0 0 ] 0.0;
    borderL         borderL  [ 0 1 0 0 0 0 0 ] 1.5e-3;
}

scatterModel    constant;

sigma           sigma [ 0 -1 0 0 0 0 0 ] 1;
C               C [ 0 0 0 0 0 0 0 ] 1; 

// ************************************************************************* //
