examples/permeable_flat_plate/constant/solidThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType solidMixtureThermo<constHeterogeneous>;

solidComponents
(
    porousMaterial
);

porousMaterialCoeffs
{
    transport
    {
        K           0.2;
    }
    thermodynamics
    {
        Cp          1500;
        Hf          -2.12e4;
    }
    density
    {
      rho          630;
    }
};

// ************************************************************************* //
