examples/permeable_flat_plate/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync true;

patches
(
    {

        name    inlet_porous;

        patchInfo
        {
            type    cyclic;
			neighbourPatch    outlet_porous;
        }
        constructFrom set;
        set f0;
    }
	
	{

        name    outlet_porous;

        patchInfo
        {
            type    cyclic;
			neighbourPatch    inlet_porous;
        }
        constructFrom set;
        set f1;
    }
	
//	{
//       name    pboundary;
//
//        patchInfo
//        {
//            type    patch;
//        }
//        constructFrom set;
//        set b0;
//    }
);
// ************************************************************************* //
