examples/permeable_flat_plate/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    p
    {
        solver           PCG;
		//solver		ICCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           1e-2;
    }

    pFinal
    {
        $p;
        relTol           0.0;
    }


    "(U|h|Yi|Ys|porosity)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.01;
    }

    "(U|h|Yi|Ys|porosity)Final"
    {
        $U;
        relTol      0;
    }

	"(k|epsilon|R|nuTilda)"
		{
			solver          smoothSolver;
			smoother        GaussSeidel;
			tolerance       1e-05;
			relTol          0;
		}	

    Ts
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           0;
    }

    rhos
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
	
	maxDeltaT           1e-4;
    maxCo               0.25;
    alphaTemp           0.05;
    alphaY              0.05;
	Yref
    {
        O2                  0.21;
        N2                 0.79;
    }
}


relaxationFactors
{
p 0.2;
U 0.7;
k 0.5;
epsilon 0.5;
R 0.7;
nuTilda 0.7;
}

// *************************************************************************//

