examples/permeable_flat_plate/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue porosityF  1
    volScalarFieldValue porosityF0 1
    volScalarFieldValue Ts 300
);

regions
(

  boxToCell
  {
      box (-1 0 0) (5 0.020001 0.011);
      fieldValues
      (
          volScalarFieldValue porosityF  0.875
          volScalarFieldValue porosityF0 0.875
		  volTensorFieldValue Df (3.4e8 0 0 0 3.4e8 0 0 0 3.4e8)
          volVectorFieldValue U (0 0 0)
      );
  }

);


// ************************************************************************* //
